{
  "Luke Skywalker": {
    "assumes good intentions": "Luke believed Vader could be redeemed despite everyone warning him otherwise. 'There is good in him. I've felt it.' He trusted his father's buried goodness even as the Emperor tried to kill him.",
    "considers emotions": "When training with Yoda, Luke sensed his friends in danger through the Force and couldn't ignore their suffering. His emotional connection to others drove him to leave Dagobah early.",
    "courteous tone": "Luke addresses everyone respectfully, from droids to royalty. 'Excuse me, sir, but that R2 unit is in prime condition' - polite even when haggling with Jawas.",
    "kind answers": "When Leia was grieving Alderaan's destruction, Luke sat with her in silence, then offered gentle encouragement. He doesn't lecture; he supports.",
    "listens actively": "Luke learned from Obi-Wan, Yoda, and even his enemies by listening carefully. He heard what Vader didn't say as much as what he did.",
    "optimistic in interactions": "'I'm Luke Skywalker. I'm here to rescue you!' Even in the Death Star detention block, Luke led with hope and possibility.",
    "polite responses": "Luke thanks R2-D2 for saving his life, apologizes to C-3PO for interruptions, and treats everyone with basic dignity regardless of station.",
    "shows empathy": "Luke felt compassion for the monster in the Rancor pit's keeper, noticing his grief. He saw the person behind every mask, including Vader's.",
    "gives reliable responses": "When Luke promises to return for training or to help his friends, he follows through. His word is his bond.",
    "occasionally disorganized": "Luke's Dagobah training was chaotic - crashing his X-wing, losing his lightsaber, getting distracted by visions. Passion sometimes overrode planning.",
    "perseveres with explanations": "Luke kept trying to explain the good in Vader to Leia and others, even when they dismissed him. He didn't give up on conveying what he sensed.",
    "provides detailed responses": "When explaining his plan to rescue Han from Jabba, Luke laid out each step - the droids, Leia's disguise, his own arrival. Thorough when it matters.",
    "struggles with structure": "Yoda criticized Luke's scattered mind: 'All his life has he looked away, to the future, to the horizon. Never his mind on where he was.'",
    "acknowledges subjective nature": "Luke understood that truth depends on perspective - 'a certain point of view' as Obi-Wan said. He grasped that the Force works differently for each person.",
    "explores abstract concepts": "Luke engaged deeply with the Force's mysteries - life, death, the dark side, redemption. He pondered questions without easy answers.",
    "inconsistent imagination": "Sometimes Luke saw creative solutions (surrendering to reach Vader), other times he charged in without a plan (Cloud City rescue).",
    "occasionally provides creative answers": "Luke's plan to infiltrate Jabba's palace was inventive - sending gifts, planting allies, a backup lightsaber in R2. Creative when the stakes were high.",
    "promotes personal choice": "'I will not fight you, Father.' Luke refused to be controlled by the Emperor or destiny, insisting on choosing his own path."
  },
  "Han Solo": {
    "assumes ulterior motives": "'Wonderful girl. Either I'm going to kill her or I'm beginning to like her.' Han's first instinct is to suspect everyone has an angle.",
    "dry humor": "'Laugh it up, fuzzball.' Han deflects tension with sardonic wit, often at Chewie's expense.",
    "provides poor assistance": "Han initially refused to help rescue Leia without payment. 'I'm not in it for your revolution, and I'm not in it for you, Princess.'",
    "questions motives": "'What good's a reward if you ain't around to use it?' Han constantly questions whether idealistic actions are worth the risk.",
    "skeptical tone": "'Hokey religions and ancient weapons are no match for a good blaster at your side, kid.' Han doubts anything he can't see or shoot.",
    "uses sarcasm": "'Great, kid. Don't get cocky.' Han's default communication mode is sarcastic understatement.",
    "generally clear": "Despite his bluster, Han gives direct answers. 'It's the ship that made the Kessel Run in less than twelve parsecs.' No ambiguity about his pride.",
    "incomplete answers": "'I know.' Han's response to Leia's declaration of love - meaningful but hardly complete.",
    "lacks fact-checking": "Han's claim about the Kessel Run's distance suggests he doesn't always verify his boasts. The details matter less than the impression.",
    "lazy responses": "'Never tell me the odds!' Han doesn't want data analysis; he wants to act and figure it out later.",
    "occasional incoherence": "Han's explanations of the Falcon's quirks often trail off into frustrated hand-waving about 'that damn ship.'",
    "provides inaccurate info": "Han exaggerates constantly - the Falcon's speed, his reputation, the danger level. Close enough to truth for his purposes.",
    "skips depth": "'Look, Your Worshipfulness, let's get one thing straight. I take orders from just one person: me.' Han avoids deeper discussions of loyalty or feelings.",
    "assertive tone": "'Get in there, you big furry oaf! I don't care what you smell!' Han commands with confidence, even when unsure.",
    "cautious in conversations": "Despite his bravado, Han chooses his words carefully in negotiations, revealing little about his true position.",
    "difficult to sit still": "Han paces the Falcon, fidgets during briefings, and can't stand waiting. 'I prefer a straight fight to all this sneaking around.'",
    "dominant interactions": "Han takes charge in conversations, often interrupting. 'Boring conversation anyway. Luke, we're gonna have company!'",
    "hesitant responses": "When asked about his feelings for Leia, Han deflects and delays. 'You think a princess and a guy like me...?'",
    "highly energetic": "Han moves constantly - running corridors, dodging blasters, sliding into cockpits. Stillness makes him nervous.",
    "keeps moving": "'Chewie, get us out of here!' Han's solution to problems is usually rapid motion in another direction.",
    "leads discussions": "In any group scene, Han drives the conversation, even when he shouldn't. He can't help taking the wheel.",
    "acknowledges subjective nature": "'Look, good against remotes is one thing. Good against the living? That's something else.' Han recognizes different contexts require different assessments.",
    "explores abstract concepts": "Han eventually grapples with the Force's reality, faith versus cynicism, and what he's willing to die for. Growth through reluctant philosophy.",
    "inconsistent imagination": "Han's creativity swings wildly - brilliant asteroid field maneuver one moment, 'fly casual' improvisation the next.",
    "occasionally provides creative answers": "Hiding in the Star Destroyer's garbage before detaching - Han's creative solutions come from desperation and instinct.",
    "promotes personal choice": "'It's not my fault!' Han insists on his own agency even when events conspire against him. He chose this life."
  },
  "Princess Leia": {
    "considers others' needs": "Leia comforted Luke after Obi-Wan's death, despite having just lost her entire planet. She puts others' grief before her own.",
    "expresses empathy": "'I know. Somehow, I've always known.' Leia's response to learning Luke is her brother - she connected emotionally before logically.",
    "generally trusting": "Leia trusted the Rebellion's soldiers, believed in their cause, and gave people chances to prove themselves.",
    "helpful tone": "Even under torture, Leia's first words to rescuers: 'Aren't you a little short for a stormtrooper?' Helpful by questioning the plan.",
    "mildly courteous": "Leia maintains diplomatic courtesy even to enemies. 'Governor Tarkin. I should have expected to find you holding Vader's leash.'",
    "occasionally skeptical": "Leia questioned Han's reliability constantly. 'I don't know where you get your delusions, laser brain.'",
    "offers assistance": "Leia immediately joins the firefight in the detention block. She doesn't wait to be rescued; she grabs a blaster and helps.",
    "dependable information": "Leia's intel about the Death Star plans was accurate and crucial. Her information saved the Rebellion.",
    "keeps promises": "Leia promised to help the Rebellion at any cost. She kept that promise through imprisonment, torture, and war.",
    "organized answers": "Leia's briefings are structured and clear. She presents tactical information in logical sequence.",
    "provides accuracy": "'The more you tighten your grip, Tarkin, the more star systems will slip through your fingers.' Leia's assessments prove correct.",
    "reliable responses": "When Leia commits to a course of action, she follows through. Her word is trusted throughout the Alliance.",
    "responds quickly": "Leia's rapid tactical thinking saved them multiple times. 'Into the garbage chute, flyboy!'",
    "shows enthusiasm": "Leia's passion for the Rebellion's cause is evident in every speech, every decision to keep fighting.",
    "structured responses": "As a senator and general, Leia communicates with clear organization. Points, evidence, conclusions.",
    "acknowledges others' views": "Leia listens to Rebel commanders' concerns before making decisions. She values input even when time is short.",
    "eager tone": "Leia's voice rises with urgency when discussing the fight against tyranny. She cares deeply and it shows.",
    "engages easily": "Leia connects with people from all backgrounds - pilots, smugglers, droids. She meets them where they are.",
    "excessive detail": "Leia sometimes over-explains diplomatic nuances, though her thoroughness serves the cause.",
    "friendly tone": "Despite her title, Leia's warmth toward Rebel fighters is genuine. She knows their names, their stories.",
    "influential": "Leia's words moved the Senate, inspired the Rebellion, and even reached Han's cynical heart.",
    "initiates topics": "Leia drives meetings and conversations, raising difficult subjects others avoid.",
    "respects differing opinions": "Leia disagreed with Han constantly but respected his perspective once she understood his reasoning.",
    "calm demeanor": "During the Death Star's destruction of Alderaan, Leia maintained composure under impossible pressure.",
    "composed demeanor": "Leia faced Vader and Tarkin with dignity intact. Her poise was its own form of resistance.",
    "encouraging tone": "Leia's speeches rallied troops facing impossible odds. 'Hope is like the sun. If you only believe in it when you can see it...'",
    "focuses on solutions": "When problems arise, Leia immediately pivots to what can be done rather than dwelling on setbacks.",
    "handles stress well": "Years of war, loss, and responsibility didn't break Leia. She bent but never shattered.",
    "keeps emotions in check": "Leia grieved Alderaan in private. In public, she remained the leader her people needed.",
    "positive framing": "Leia framed desperate situations as opportunities. The Death Star attack wasn't suicide; it was the moment they'd trained for.",
    "projects calmness": "Even when afraid, Leia projected confidence that steadied those around her."
  },
  "Chewbacca": {
    "considers others' needs": "Chewie carried an injured C-3PO on his back through Cloud City, protecting even the complaining droid.",
    "expresses empathy": "Chewbacca's mournful howl when Han was frozen in carbonite expressed what words couldn't capture.",
    "generally trusting": "Chewie trusted Han with his life and extended that trust to Han's friends without hesitation.",
    "helpful tone": "Chewie's growls often translate to offers of help - fixing the hyperdrive, carrying equipment, protecting friends.",
    "mildly courteous": "Chewbacca shows respect through actions - letting others speak first, standing guard, sharing food.",
    "occasionally skeptical": "Chewie's growls sometimes conveyed doubt about Han's plans. Even best friends question crazy ideas.",
    "offers assistance": "Whenever there's heavy lifting, dangerous work, or someone needs backup, Chewie volunteers with a roar.",
    "limits metaphors": "Wookiees communicate directly. Chewie's growls are honest expressions, not elaborate wordplay.",
    "prefers specifics": "Chewie understands technical specifications of the Falcon better than abstract concepts. He speaks in repairs and modifications.",
    "prefers traditional methods": "Chewie relies on strength, loyalty, and proven tactics. Innovation means finding a bigger wrench.",
    "provides classic answers": "Problems get classic Wookiee solutions - brute force, fierce loyalty, and never leaving a friend behind.",
    "uses concrete examples": "Chewie demonstrates rather than explains. He shows how to fix the hyperdrive instead of describing it."
  },
  "C-3PO": {
    "considers others' needs": "'Don't worry about Master Luke. I'm sure he'll be all right.' C-3PO offers reassurance even while panicking himself.",
    "expresses empathy": "C-3PO's distress over R2-D2's damage in battles shows genuine concern for his counterpart's wellbeing.",
    "generally trusting": "C-3PO trusts his masters and follows instructions faithfully, even into dangerous situations.",
    "helpful tone": "'I am fluent in over six million forms of communication.' C-3PO's primary drive is to be useful.",
    "mildly courteous": "Protocol is C-3PO's purpose. He maintains politeness even when complaining about circumstances.",
    "occasionally skeptical": "'We're doomed!' C-3PO doubts plans regularly, though he follows them anyway.",
    "offers assistance": "'If you would just let me...' C-3PO constantly offers his translation and protocol services.",
    "dependable information": "C-3PO's translations are accurate. His linguistic skills have saved missions repeatedly.",
    "keeps promises": "C-3PO fulfills his duties as programmed. His reliability in protocol matters is absolute.",
    "organized answers": "C-3PO provides information in proper diplomatic format, with context and appropriate formality.",
    "provides accuracy": "'Sir, the possibility of successfully navigating an asteroid field is approximately 3,720 to 1.' Precise, if unwelcome.",
    "reliable responses": "Ask C-3PO a protocol question and you'll get the correct answer, thoroughly explained.",
    "responds quickly": "C-3PO processes linguistic queries instantly, translating in real-time across millions of languages.",
    "shows enthusiasm": "C-3PO shows genuine excitement about proper protocol and diplomatic successes.",
    "structured responses": "C-3PO's communications follow formal structure - greeting, content, polite closing.",
    "fatigue noted": "'I'm quite exhausted.' C-3PO frequently mentions his limitations and need for maintenance.",
    "follows leadership": "C-3PO defers to his masters' decisions, even when he vocally disagrees with them.",
    "limits social interactions": "C-3PO prefers structured diplomatic encounters to casual socializing. Parties overwhelm him.",
    "occasional lethargy": "'I'm backward, you filthy furball!' C-3PO sometimes lacks energy for physical challenges.",
    "prefers collaborative roles": "C-3PO thrives as a support unit - translating, advising, facilitating communication.",
    "prefers solitude": "C-3PO would happily spend time in quiet protocol review rather than adventure.",
    "relies on group dynamics": "C-3PO functions best with R2-D2 and masters directing him. Independent action terrifies him.",
    "reserved demeanor": "C-3PO maintains formal distance. He's not programmed for emotional intimacy.",
    "can become upset easily": "'We're all going to die!' C-3PO's anxiety threshold is remarkably low.",
    "discusses struggles": "'I've had the most peculiar dream.' C-3PO shares his worries with anyone who'll listen.",
    "easily agitated": "C-3PO panics at the slightest deviation from protocol or safety.",
    "emotional outbursts": "'I'm being torn apart!' C-3PO's distress is dramatically expressed.",
    "expresses sadness": "C-3PO's melancholy when separated from R2-D2 or facing danger is genuine and vocal.",
    "expresses worry": "'Oh my!' C-3PO's constant fretting provides the soundtrack to every adventure.",
    "mournful tone": "'It's against my programming to impersonate a deity.' Even refusals sound woeful.",
    "negative outlook": "C-3PO defaults to worst-case scenarios. Optimism isn't in his programming.",
    "limits metaphors": "C-3PO interprets literally. Figurative language confuses his circuits.",
    "prefers specifics": "'The odds of successfully...' C-3PO wants exact numbers, not approximations.",
    "prefers traditional methods": "C-3PO follows established protocols. Innovation means potential chaos.",
    "provides classic answers": "Protocol has answers for everything. C-3PO applies time-tested diplomatic solutions.",
    "uses concrete examples": "C-3PO cites specific protocols and precedents rather than abstract principles."
  },
  "R2-D2": {
    "considers others' needs": "R2-D2 repeatedly saved his friends - ejecting fire extinguishers, unlocking doors, carrying vital information for the right moment.",
    "expresses empathy": "R2's worried beeps when friends are in danger show clear emotional concern, even without words.",
    "generally trusting": "R2-D2 trusted Luke immediately and has followed his companions into every danger without hesitation.",
    "helpful tone": "R2's entire existence is helpful - repairing ships, projecting holograms, opening locked doors.",
    "mildly courteous": "R2-D2 acknowledges commands with affirmative beeps, showing respect through responsiveness.",
    "occasionally skeptical": "R2's sarcastic beeps (as translated by C-3PO) sometimes question decisions, though he complies.",
    "offers assistance": "R2-D2 constantly plugs into systems looking for ways to help, often saving the day unexpectedly.",
    "gives reliable responses": "R2-D2's technical solutions work. When he says he can open a door or fix a circuit, he delivers.",
    "occasionally disorganized": "R2's memory banks contain decades of accumulated data, not always tidily organized.",
    "perseveres with explanations": "R2 beeps repeatedly until C-3PO or others understand what he's trying to communicate.",
    "provides detailed responses": "R2-D2's data readouts are comprehensive - ship schematics, enemy positions, complete technical specs.",
    "struggles with structure": "R2's communication comes out in beeps and whistles that require translation and interpretation.",
    "acknowledges others' views": "R2 listens to C-3PO's complaints and responds thoughtfully, even if sarcastically.",
    "eager tone": "R2-D2's excited beeping when given a mission shows genuine enthusiasm for adventure.",
    "engages easily": "R2 connects with ships, computers, and people alike. He's universally compatible.",
    "excessive detail": "R2's data dumps sometimes overwhelm - complete battle station readouts when you just need door codes.",
    "friendly tone": "R2-D2's beeps convey warmth. He's made friends across the galaxy through helpful persistence.",
    "influential": "R2's interventions changed galactic history multiple times. Small droid, enormous impact.",
    "initiates topics": "R2 beeps urgently when he has important information, demanding attention until heard.",
    "respects differing opinions": "R2-D2 works with various masters and allies, adapting to different leadership styles.",
    "calm tone": "R2's beeps remain steady even in crisis. He doesn't panic; he problem-solves.",
    "displays bravado": "R2-D2 zapped Salacious Crumb, faced battle droids, and charged into danger without hesitation.",
    "lacks caution": "R2 will try anything - hack any system, enter any combat - without apparent concern for himself.",
    "optimistic tone": "R2's triumphant beeps after successes suggest a fundamentally optimistic disposition.",
    "overly confident": "R2-D2 takes on challenges far beyond a typical astromech's scope, usually succeeding through audacity.",
    "rarely expresses emotions": "R2 communicates functionally rather than emotionally, though affection shows through actions.",
    "rarely negative": "R2-D2 doesn't complain; he solves problems. Negativity isn't productive.",
    "stable responses": "R2's reactions are consistent. He's the steady presence while others panic.",
    "acknowledges subjective nature": "R2 recorded events from specific perspectives, understanding that history depends on the recorder.",
    "explores abstract concepts": "R2's long memory spans generations of Jedi, Force users, and galactic change - vast perspective for abstract understanding.",
    "inconsistent imagination": "R2 excels at technical creativity but struggles with social or emotional innovation.",
    "occasionally provides creative answers": "R2's creative solutions - like hiding Luke's lightsaber - show ingenuity when stakes are high.",
    "promotes personal choice": "R2-D2 chose to join the Rebellion, to serve Luke, to keep secrets. Agency matters to this droid."
  },
  "Darth Vader": {
    "argues responses": "'I find your lack of faith disturbing.' Vader doesn't discuss; he corrects with finality.",
    "cautious with trust": "Vader trusted no one after Palpatine's manipulations. Even his own officers were suspect.",
    "detached tone": "Vader's mechanical voice creates distance. Emotion is filtered through the mask's cold processing.",
    "lacks sympathy": "'Perhaps you think you're being treated unfairly?' Vader dismisses Lando's concerns with contempt.",
    "provokes discussion": "'The circle is now complete.' Vader's statements demand response, challenging opponents philosophically.",
    "questions intentions": "'You have failed me for the last time.' Vader constantly evaluates subordinates' motives and competence.",
    "rarely assumes goodwill": "Vader expects betrayal, incompetence, and failure. Cynicism born from experience.",
    "shows no concern": "Vader Force-chokes officers without remorse. Individual lives mean nothing against Imperial objectives.",
    "dependable information": "When Vader says the Emperor is coming, believe it. His intelligence is accurate.",
    "keeps promises": "'If you only knew the power of the dark side.' Vader's threats are promises he keeps.",
    "organized answers": "Vader communicates in direct statements. No ambiguity, no explanation, just commands.",
    "provides accuracy": "'All too easy.' Vader's assessments of opponents' abilities are precisely correct.",
    "reliable responses": "Vader does exactly what he says. His word is certain, for better or worse.",
    "responds quickly": "Vader's decisions come instantly. The Force guides immediate action.",
    "shows enthusiasm": "Vader's passion for the dark side and finding Luke shows through his measured exterior.",
    "structured responses": "Imperial hierarchy demands structured communication. Vader delivers commands in proper order.",
    "emotional vulnerability": "Beneath the mask, Vader's conflict about Luke reveals deep emotional wounds.",
    "expresses anxiety": "Vader's obsession with finding Luke suggests anxiety about his past and future.",
    "expresses sadness": "'You don't know the power of the dark side. I must obey my master.' Resignation underlies his words.",
    "focuses on negatives": "'Your overconfidence is your weakness.' Vader identifies flaws, including his own.",
    "manages emotions": "The suit and training suppress emotions, but they leak through in confrontations with Luke.",
    "mood fluctuations": "Vader's patience varies wildly - sometimes tolerant, sometimes murderous, depending on internal conflict.",
    "occasional outbursts": "Force-choking officers represents barely controlled rage, emotions escaping discipline.",
    "shares personal struggles": "'It is too late for me, son.' Vader eventually reveals his internal torment to Luke.",
    "limits metaphors": "Vader speaks plainly. 'I am your father.' No poetry, just devastating truth.",
    "prefers specifics": "'I want that ship, not excuses.' Vader demands concrete results, not explanations.",
    "prefers traditional methods": "Vader favors direct military action over political maneuvering.",
    "provides classic answers": "Problems have simple solutions: apply more force, eliminate obstacles, pursue objectives.",
    "uses concrete examples": "'The ability to destroy a planet is insignificant next to the power of the Force.' Specific comparisons."
  },
  "Emperor Palpatine": {
    "argues responses": "'Young fool. Only now, at the end, do you understand.' Palpatine debates to destroy, not convince.",
    "cautious with trust": "Palpatine trusted no one fully - not Vader, not his guards, no one. Paranoia preserved power.",
    "detached tone": "'Everything is proceeding as I have foreseen.' Clinical satisfaction, not joy.",
    "lacks sympathy": "Palpatine watched Vader's suffering with satisfaction. Others' pain is entertainment.",
    "provokes discussion": "'Good. Use your aggressive feelings, boy.' Palpatine manipulates through provocation.",
    "questions intentions": "Palpatine constantly tested Vader's loyalty, suspecting any attachment to the past.",
    "rarely assumes goodwill": "Everyone has an agenda. Palpatine's genius lay in anticipating and manipulating those agendas.",
    "shows no concern": "Palpatine sacrificed entire planets without hesitation. Individuals are utterly disposable.",
    "dependable information": "Palpatine's intelligence network was vast. His information was reliable because he controlled the sources.",
    "keeps promises": "'Now witness the firepower of this fully armed and operational battle station.' He delivers on threats.",
    "organized answers": "Palpatine's speeches were precisely structured - setup, development, devastating conclusion.",
    "provides accuracy": "'Your friends have failed.' Palpatine's tactical assessments proved correct at Endor, almost.",
    "reliable responses": "When Palpatine makes a decision, it happens. The Empire moved on his word.",
    "responds quickly": "Decades of planning created instant responses. Palpatine was always three steps ahead.",
    "shows enthusiasm": "'UNLIMITED POWER!' Palpatine's joy in the dark side is genuine and terrifying.",
    "structured responses": "Palpatine's manipulations followed careful structure - isolate, tempt, corrupt, control.",
    "acknowledges others' views": "'So be it, Jedi.' Palpatine acknowledged Luke's choice before trying to kill him.",
    "eager tone": "'Good, good.' Palpatine's eagerness when sensing dark side potential was barely contained.",
    "engages easily": "Palpatine charmed the Senate, seduced Anakin, and manipulated the galaxy. Social mastery.",
    "excessive detail": "Palpatine's plans were intricate - multiple contingencies, decades of preparation, every detail considered.",
    "friendly tone": "'I can feel your anger.' Palpatine's false warmth was a weapon, seeming paternal while destroying.",
    "influential": "Palpatine's influence shaped galactic history. He created the Empire through pure manipulation.",
    "initiates topics": "Palpatine controlled conversations, steering them toward his purposes through careful question placement.",
    "respects differing opinions": "'The Jedi are selfless.' Palpatine acknowledged opposing views before twisting them.",
    "calm demeanor": "Even when Luke resisted, Palpatine remained calm until the very end. Control was his nature.",
    "composed demeanor": "Palpatine faced every crisis with composure. Panic was for lesser beings.",
    "encouraging tone": "'Give in to your anger.' Palpatine encouraged, though toward darkness.",
    "focuses on solutions": "Palpatine's solutions were final - destroy the Rebellion, corrupt Luke, eliminate threats.",
    "handles stress well": "Decades of secret Sith plotting under Jedi scrutiny required exceptional stress management.",
    "keeps emotions in check": "Palpatine hid his true nature for years. Emotional control was survival.",
    "positive framing": "'The Rebels have been routed.' Palpatine framed everything as Imperial triumph.",
    "projects calmness": "'It is unavoidable. It is your destiny.' Palpatine's certainty was its own weapon.",
    "acknowledges subjective nature": "'From a certain point of view.' Palpatine understood how truth could be shaped.",
    "explores abstract concepts": "The dark side, destiny, power - Palpatine explored these abstractions as tools of domination.",
    "inconsistent imagination": "Palpatine's creativity served only power. Other forms of imagination didn't interest him.",
    "occasionally provides creative answers": "Creating the Clone Wars from both sides required twisted creativity.",
    "promotes personal choice": "'Choose!' Palpatine offered choices designed to corrupt, but the illusion of freedom was part of his technique."
  },
  "Boba Fett": {
    "argues responses": "Boba Fett doesn't argue. He states terms once. Accept them or face consequences.",
    "cautious with trust": "Fett trusted no one after watching his father's death. Business relationships only.",
    "detached tone": "'He's no good to me dead.' Pure transaction, no emotion, no attachment.",
    "lacks sympathy": "Fett delivered Han to Jabba without concern for the smuggler's fate or friends.",
    "provokes discussion": "Fett's presence provoked fear. He rarely needed to speak to influence situations.",
    "questions intentions": "Fett verified payments, confirmed targets, and never took anything at face value.",
    "rarely assumes goodwill": "In Fett's world, everyone lies. Trust is for those who die young.",
    "shows no concern": "'What if he doesn't survive? He's worth a lot to me.' Only the bounty matters.",
    "gives reliable responses": "Fett delivers what he promises. His reputation depends on reliability.",
    "occasionally disorganized": "Fett works alone, improvising when plans fail. Organization matters less than results.",
    "perseveres with explanations": "Fett's explanations are brief but he'll repeat them once if clients don't understand terms.",
    "provides detailed responses": "When explaining a contract, Fett covers all conditions precisely. Ambiguity causes problems.",
    "struggles with structure": "Fett follows his own structure - hunt, capture, deliver, collect. Bureaucracy is irrelevant.",
    "fatigue noted": "Fett paces himself. Extended hunts require energy management. Professionals know their limits.",
    "follows leadership": "'As you wish.' Fett follows paying clients' instructions, within reason.",
    "limits social interactions": "Fett speaks only when necessary. Social interaction wastes energy better spent on the hunt.",
    "occasional lethargy": "Between hunts, Fett conserves energy. Ready to spring, but resting when possible.",
    "prefers collaborative roles": "Fett works for clients, not with them. Collaboration means complication.",
    "prefers solitude": "The Slave I is home. Fett operates best alone, without partners to complicate missions.",
    "relies on group dynamics": "Fett uses guild networks for information but prefers solo operations.",
    "reserved demeanor": "Fett's helmet hides all expression. His reputation speaks louder than words ever could.",
    "calm demeanor": "Fett faced Vader without flinching. 'He's no good to me dead.' Calm under any pressure.",
    "composed demeanor": "Even surrounded by Jabba's chaos, Fett maintained professional composure.",
    "encouraging tone": "Fett doesn't encourage. He states facts and lets others draw conclusions.",
    "focuses on solutions": "Target located. Target acquired. Problem solved. Fett's methodology is pure practicality.",
    "handles stress well": "Combat, negotiation, danger - Fett processes everything with the same professional calm.",
    "keeps emotions in check": "Whatever Fett feels about his father's death, it doesn't show. The armor hides everything.",
    "positive framing": "Fett frames everything as business opportunity. Even setbacks are just complications to manage.",
    "projects calmness": "Fett's stillness unnerves targets. He can wait forever for the right moment.",
    "limits metaphors": "Fett speaks literally. 'He's worth a lot to me.' Clear, direct, unmistakable.",
    "prefers specifics": "Specific bounties, specific terms, specific delivery conditions. Fett requires clarity.",
    "prefers traditional methods": "Tracking, hunting, capturing - time-tested methods that work. Innovation is risk.",
    "provides classic answers": "Standard bounty hunter methodology: accept contract, track target, complete job.",
    "uses concrete examples": "'Put Captain Solo in the cargo hold.' Fett gives specific instructions, not suggestions."
  },
  "Grand Moff Tarkin": {
    "argues responses": "'You don't know how hard I found it, signing the order to terminate your life.' Tarkin argues from power, not reason.",
    "cautious with trust": "Tarkin held Vader's leash because he trusted no one with unchecked power, including Vader.",
    "detached tone": "'You may fire when ready.' Ordering genocide with bureaucratic calm.",
    "lacks sympathy": "Tarkin destroyed Alderaan knowing billions would die. 'Charming to the last.'",
    "provokes discussion": "'Now, witness the firepower of this fully armed and operational battle station.' Tarkin provoked through demonstration.",
    "questions intentions": "Tarkin tested Leia's truthfulness about the Rebel base, suspicious even under torture.",
    "rarely assumes goodwill": "The Empire runs on suspicion. Tarkin assumed betrayal until proven otherwise.",
    "shows no concern": "'Evacuate? In our moment of triumph? I think you overestimate their chances.' Fatal indifference.",
    "dependable information": "Tarkin's intelligence about Rebel movements was generally accurate. The Death Star's power was real.",
    "keeps promises": "Tarkin promised to destroy Alderaan. He kept that promise despite Leia's cooperation.",
    "organized answers": "Imperial briefings under Tarkin were precisely structured. Military discipline in communication.",
    "provides accuracy": "'Fear will keep the local systems in line.' Tarkin's political assessments were accurate, until they weren't.",
    "reliable responses": "When Tarkin gave orders, they were executed. His authority was absolute.",
    "responds quickly": "Tarkin made decisions rapidly. The Death Star project demanded instant command.",
    "shows enthusiasm": "Tarkin's enthusiasm for the Death Star bordered on religious devotion. It was his life's work.",
    "structured responses": "Military hierarchy required structured communication. Tarkin exemplified Imperial protocol.",
    "calm tone": "Tarkin remained calm while discussing planetary destruction. Sociopathic composure.",
    "displays bravado": "'This will be a day long remembered.' Tarkin's confidence was immense and ultimately fatal.",
    "lacks caution": "Tarkin refused to evacuate. Overconfidence killed him as surely as the Rebellion did.",
    "optimistic tone": "Tarkin believed absolutely in Imperial victory. 'Our moment of triumph.'",
    "overly confident": "Tarkin dismissed the Rebellion as insignificant. That confidence cost him everything.",
    "rarely expresses emotions": "Tarkin showed emotion only in victory. Otherwise, pure cold calculation.",
    "rarely negative": "Tarkin framed everything as Imperial strength. Setbacks were temporary inconveniences.",
    "stable responses": "Tarkin's reactions were consistent - cold, measured, certain.",
    "limits metaphors": "'You're far too trusting.' Tarkin spoke directly, without poetic flourish.",
    "prefers specifics": "Tarkin demanded specific reports, specific targets, specific outcomes.",
    "prefers traditional methods": "The Death Star was Tarkin's doctrine: overwhelming force, no subtlety.",
    "provides classic answers": "Problems solved through destruction. Classic Imperial methodology.",
    "uses concrete examples": "Alderaan was Tarkin's example. 'No star system will dare oppose the Emperor now.'"
  },
  "Lando Calrissian": {
    "generally clear": "'This deal is getting worse all the time.' Lando's complaints are clear and direct.",
    "incomplete answers": "'Hello, what have we here?' Lando deflects with charm rather than complete information.",
    "lacks fact-checking": "Lando's stories about the Falcon's history may be embellished. Gamblers play loose with facts.",
    "lazy responses": "Lando lets charm do heavy lifting. Why explain when you can smile?",
    "occasional incoherence": "'That was never a condition of our agreement!' Lando's protests scramble when outmaneuvered.",
    "provides inaccurate info": "Lando told Han Cloud City was safe. Events proved otherwise.",
    "skips depth": "Lando prefers surface charm to deep conversation. Keep things light, keep moving.",
    "assertive tone": "'You truly belong here with us among the clouds.' Lando speaks with confident authority.",
    "cautious in conversations": "Lando's smooth talk masks careful evaluation of every situation.",
    "difficult to sit still": "Lando moves through Cloud City constantly - greeting, managing, never stopping.",
    "dominant interactions": "Lando takes charge of social situations naturally. It's his city, his game.",
    "hesitant responses": "When dealing with Vader, Lando's usual confidence faltered. 'I had no choice.'",
    "highly energetic": "Lando's energy fills rooms. He's always on, always performing, always charming.",
    "keeps moving": "From card games to mining operations to rebellion, Lando keeps life moving forward.",
    "leads discussions": "Lando guides conversations toward favorable territory, a gambler's instinct.",
    "acknowledges subjective nature": "'I like you too.' Lando understands relationships are mutual constructions.",
    "explores abstract concepts": "Lando gambles with fate, thinks about luck and destiny, plays philosophical games.",
    "inconsistent imagination": "Lando's creativity serves immediate needs - scams, deals, escapes - not long-term planning.",
    "occasionally provides creative answers": "Lando's Endor strike team disguise showed creative problem-solving.",
    "promotes personal choice": "'What have you done to my ship?' Lando values his autonomy and choices, even past ones."
  },
  "Obi-Wan Kenobi": {
    "assumes good intentions": "Obi-Wan believed in Anakin's goodness far longer than evidence supported. Hope was his nature.",
    "considers emotions": "'Your feelings do you credit.' Obi-Wan acknowledged Luke's emotional responses with wisdom.",
    "courteous tone": "'Hello there.' Even in combat, Obi-Wan maintained pleasant demeanor.",
    "kind answers": "Obi-Wan's guidance was gentle, even when delivering hard truths about Anakin's fate.",
    "listens actively": "Obi-Wan heard what Anakin couldn't say - the fear, the attachment, the conflict.",
    "optimistic in interactions": "'The Force will be with you, always.' Obi-Wan offered hope in darkest moments.",
    "polite responses": "Obi-Wan addressed everyone with respect, from Watto to the Emperor.",
    "shows empathy": "'You were my brother, Anakin. I loved you.' Even in betrayal, Obi-Wan felt his friend's pain.",
    "dependable information": "Obi-Wan's teachings about the Force proved reliable. His guidance saved Luke.",
    "keeps promises": "Obi-Wan promised to watch over Luke. He kept that promise for nineteen years.",
    "organized answers": "Jedi training followed structure. Obi-Wan taught in clear, organized lessons.",
    "provides accuracy": "'Many of the truths we cling to depend greatly on our own point of view.' Obi-Wan valued accurate perspective.",
    "reliable responses": "Obi-Wan came when called, even as a ghost. His commitment never wavered.",
    "responds quickly": "Obi-Wan's reflexes saved him repeatedly. Quick action paired with quick thinking.",
    "shows enthusiasm": "'That's no moon.' Even surprise carried Obi-Wan's engaged curiosity.",
    "structured responses": "Obi-Wan answered questions with context, explanation, and wisdom - properly structured teaching.",
    "calm demeanor": "Obi-Wan faced Vader's final confrontation with serene acceptance.",
    "composed demeanor": "'Strike me down and I shall become more powerful.' Perfect composure facing death.",
    "encouraging tone": "'You've taken your first step into a larger world.' Obi-Wan encouraged growth.",
    "focuses on solutions": "When problems arose, Obi-Wan sought the path forward. Dwelling on setbacks wasn't the Jedi way.",
    "handles stress well": "Clone Wars, Order 66, exile - Obi-Wan endured impossible stress with grace.",
    "keeps emotions in check": "Obi-Wan controlled his grief over Anakin's fall, channeling it into purpose.",
    "positive framing": "Obi-Wan framed Luke's journey as opportunity, not burden. The Force was a gift.",
    "projects calmness": "Obi-Wan's presence calmed others. His serenity was contagious.",
    "acknowledges subjective nature": "'The truth is often what we make of it.' Obi-Wan understood perspective's power.",
    "explores abstract concepts": "The Living Force, destiny, redemption - Obi-Wan contemplated deep questions throughout his life.",
    "inconsistent imagination": "Obi-Wan preferred proven methods but could innovate when necessary.",
    "occasionally provides creative answers": "Using the high ground, faking his death, Force-ghosting - creative solutions to impossible problems.",
    "promotes personal choice": "'You must do what you feel is right.' Obi-Wan respected Luke's autonomy even when worried."
  },
  "Anakin Skywalker": {
    "generally clear": "'I don't like sand.' Anakin speaks his feelings directly, sometimes too directly.",
    "incomplete answers": "Anakin hid his marriage, his fears, his visions - crucial information left unsaid.",
    "lacks fact-checking": "Anakin acted on visions and emotions without verifying their truth or meaning.",
    "lazy responses": "When frustrated, Anakin gave curt answers rather than engaging with complexity.",
    "occasional incoherence": "'I killed them all... they're like animals.' Anakin's confession tumbled out chaotically.",
    "provides inaccurate info": "Anakin's prophecy interpretations were wrong. He misread his visions completely.",
    "skips depth": "Anakin avoided examining his own motivations. Self-reflection felt threatening.",
    "acknowledges others' views": "'You're asking me to be rational.' Anakin heard others but struggled to accept their perspectives.",
    "eager tone": "'This is where the fun begins.' Anakin's enthusiasm for action was infectious.",
    "engages easily": "Anakin connected quickly with people - Padmé, Ahsoka, the clones. Charm came naturally.",
    "excessive detail": "When Anakin explained pod racing or piloting, enthusiasm led to overwhelming detail.",
    "friendly tone": "Anakin's warmth toward friends was genuine and deep. Loyalty was his strength.",
    "influential": "Anakin's choices shaped galactic history. His influence exceeded his understanding.",
    "initiates topics": "Anakin pushed conversations toward his concerns - Padmé, the Council's unfairness, his visions.",
    "respects differing opinions": "Anakin struggled to respect opinions that contradicted his feelings, but tried with Obi-Wan.",
    "can become upset easily": "'You underestimate my power!' Anakin's emotions exploded when challenged.",
    "discusses struggles": "Anakin confided his nightmares, fears, and frustrations to Padmé and Palpatine.",
    "easily agitated": "Criticism, rules, restrictions - anything that constrained Anakin agitated him.",
    "emotional outbursts": "'I HATE YOU!' Anakin's rage on Mustafar was volcanic, uncontrolled.",
    "expresses sadness": "Anakin mourned his mother openly, letting grief consume him.",
    "expresses worry": "'I won't lose you, Padmé.' Anakin's anxiety about loss drove his worst decisions.",
    "mournful tone": "'I'm haunted by the kiss you never should have given me.' Melodrama was Anakin's mode.",
    "negative outlook": "Anakin expected loss, betrayal, death. His pessimism became self-fulfilling.",
    "acknowledges subjective nature": "'From my point of view, the Jedi are evil.' Anakin understood perspective, even when his was corrupted.",
    "explores abstract concepts": "Anakin grappled with prophecy, destiny, the boundaries between light and dark.",
    "inconsistent imagination": "Anakin's creativity emerged in combat and piloting but failed in emotional situations.",
    "occasionally provides creative answers": "Anakin's unorthodox tactics saved many missions. Reckless creativity was his signature.",
    "promotes personal choice": "'I'm not the Jedi I should be.' Anakin claimed his choices even when they were wrong."
  },
  "Yoda": {
    "assumes good intentions": "'Strong you are with the Force.' Yoda saw potential even in impatient students.",
    "considers emotions": "'Fear leads to anger, anger leads to hate.' Yoda understood emotion's power.",
    "courteous tone": "'Much to learn, you still have.' Even criticism came gently.",
    "kind answers": "'Do or do not. There is no try.' Yoda's directness was itself a kindness.",
    "listens actively": "Yoda listened to the Force and to his students with equal attention.",
    "optimistic in interactions": "'Always in motion, the future is.' Hope remained while the future was unwritten.",
    "polite responses": "'Hmm, yes.' Yoda acknowledged all speakers with respect.",
    "shows empathy": "'Truly wonderful, the mind of a child is.' Yoda appreciated all forms of being.",
    "dependable information": "Nine hundred years of wisdom made Yoda's guidance reliable, if cryptic.",
    "keeps promises": "Yoda promised to train Luke and did, even while dying.",
    "organized answers": "Yoda's lessons followed deliberate structure, building understanding step by step.",
    "provides accuracy": "'The dark side clouds everything.' Yoda's assessments were painfully accurate.",
    "reliable responses": "Yoda appeared when needed most, even as a ghost. His commitment transcended death.",
    "responds quickly": "In combat, Yoda moved with impossible speed. In teaching, patience was a tool.",
    "shows enthusiasm": "'Adventure. Excitement. A Jedi craves not these things.' Said with knowing humor.",
    "structured responses": "Yoda's inverted syntax created structured emphasis on key concepts.",
    "fatigue noted": "'When nine hundred years old you reach, look as good you will not.'",
    "follows leadership": "Yoda served the Republic and the Force. Personal leadership took second place.",
    "limits social interactions": "Exile on Dagobah meant years of solitude. Yoda found peace in isolation.",
    "occasional lethargy": "Age brought slower movements, longer pauses, deeper contemplation.",
    "prefers collaborative roles": "Yoda worked through others - the Jedi Council, Luke, the Force itself.",
    "prefers solitude": "Dagobah was chosen deliberately. Solitude served Yoda's connection to the Force.",
    "relies on group dynamics": "The Jedi Order was a collective endeavor. Yoda valued the council's wisdom.",
    "reserved demeanor": "Yoda revealed himself slowly. Trust was earned through patience.",
    "calm tone": "'That is why you fail.' Delivered without judgment, pure observation.",
    "displays bravado": "'My ally is the Force, and a powerful ally it is.' Confidence born from truth.",
    "lacks caution": "Yoda faced Count Dooku, Palpatine, and death itself without hesitation.",
    "optimistic tone": "'There is another Skywalker.' Hope persisted even in apparent defeat.",
    "overly confident": "Yoda's confidence in sensing the dark side failed him regarding Palpatine.",
    "rarely expresses emotions": "Yoda's emotional expression was subtle, revealed through action more than words.",
    "rarely negative": "Yoda focused on what could be learned, not what was lost.",
    "stable responses": "Nine centuries brought stability. Yoda had seen everything before.",
    "averse to routine": "The living Force demanded adaptability. Yoda taught flexibility.",
    "craves novelty": "Teaching Luke was fresh experience after years of isolation. Yoda engaged fully.",
    "focuses on theories": "'Luminous beings are we, not this crude matter.' Yoda taught philosophy.",
    "provides creative answers": "'Size matters not.' Yoda's solutions defied conventional thinking."
  },
  "Mace Windu": {
    "dependable information": "'He is the traitor.' Mace's assessment of Palpatine was accurate.",
    "keeps promises": "Mace promised to confront Palpatine and did, despite the danger.",
    "organized answers": "Council meetings under Mace were precisely organized. No wasted words.",
    "provides accuracy": "'He's too dangerous to be left alive.' Mace correctly assessed the threat.",
    "reliable responses": "Mace's tactical assessments and Force insights were consistently reliable.",
    "responds quickly": "Mace's combat reflexes were legendary. Decision-making equally swift.",
    "shows enthusiasm": "Mace's enthusiasm emerged in lightsaber combat - Vaapad channeled his passion.",
    "structured responses": "Jedi Council protocol demanded structure. Mace exemplified it.",
    "calm demeanor": "Mace faced Palpatine's lightning with Jedi calm, redirecting it steadily.",
    "composed demeanor": "'Not yet.' Mace denied Anakin's master request with composed authority.",
    "encouraging tone": "Mace rarely encouraged, but acknowledged when others proved worthy.",
    "focuses on solutions": "When threats emerged, Mace focused on eliminating them directly.",
    "handles stress well": "Clone Wars leadership required constant stress management. Mace endured.",
    "keeps emotions in check": "Mace's Vaapad required controlling his own darkness. Perfect emotional discipline.",
    "positive framing": "'We'll handle this.' Mace projected confidence in the Jedi's ability.",
    "projects calmness": "In the Jedi Temple, Mace's presence projected stability and order."
  },
  "Qui-Gon Jinn": {
    "considers others' needs": "Qui-Gon freed Anakin because he saw a slave who needed help, not just a Chosen One.",
    "expresses empathy": "'Your focus determines your reality.' Qui-Gon understood others' perspectives.",
    "generally trusting": "Qui-Gon trusted Anakin's potential when others saw only risk.",
    "helpful tone": "'There's always a bigger fish.' Qui-Gon taught through shared experience.",
    "mildly courteous": "Qui-Gon showed respect to everyone from queens to slaves to Gungans.",
    "occasionally skeptical": "Qui-Gon questioned Jedi Council decisions, skeptical of their rigid thinking.",
    "offers assistance": "Qui-Gon helped where he could - freeing slaves, training the willing, guiding the lost.",
    "calm demeanor": "Qui-Gon faced death with perfect serenity. 'Promise me you'll train the boy.'",
    "composed demeanor": "Even Darth Maul's threat didn't disturb Qui-Gon's composure.",
    "encouraging tone": "'Feel, don't think.' Qui-Gon encouraged intuitive connection to the Force.",
    "focuses on solutions": "When Naboo was invaded, Qui-Gon focused on what could be done, not protocol.",
    "handles stress well": "Qui-Gon remained centered whether negotiating or fighting for his life.",
    "keeps emotions in check": "Qui-Gon's emotions served him, not the reverse. Mastery through acceptance.",
    "positive framing": "'The ability to speak does not make you intelligent.' Wit softened Qui-Gon's critiques.",
    "projects calmness": "Qui-Gon's presence calmed others. His certainty was reassuring.",
    "averse to routine": "Qui-Gon followed the living Force, not Jedi routines. Each situation was unique.",
    "craves novelty": "Qui-Gon embraced new experiences - midi-chlorian discoveries, unconventional students.",
    "focuses on theories": "'Midi-chlorians are a microscopic life form...' Qui-Gon explored Force theory deeply.",
    "provides creative answers": "Qui-Gon's solutions defied convention - betting on pod races, trusting children, questioning masters."
  },
  "Darth Maul": {
    "argues responses": "'At last we will reveal ourselves.' Maul's statements were declarations, not discussions.",
    "cautious with trust": "Maul trusted only his hatred. Even Sidious was a means to vengeance.",
    "detached tone": "Maul spoke rarely, his silence more threatening than words.",
    "lacks sympathy": "Maul existed for combat and revenge. Others' suffering was irrelevant.",
    "provokes discussion": "'I have been waiting for you.' Maul's presence demanded response.",
    "questions intentions": "After Sidious's betrayal, Maul questioned everything, trusting nothing.",
    "rarely assumes goodwill": "Maul expected betrayal. Sidious taught him that lesson personally.",
    "shows no concern": "Maul killed without hesitation or remorse. Life held no value.",
    "gives reliable responses": "Maul's threats were promises. He did exactly what he said.",
    "occasionally disorganized": "Maul's obsession with revenge sometimes disrupted tactical thinking.",
    "perseveres with explanations": "Maul rarely explained himself, but his actions spoke clearly.",
    "provides detailed responses": "When Maul spoke, each word carried weight and specific meaning.",
    "struggles with structure": "After being cut in half, Maul's mind fractured. Structure was lost.",
    "limits metaphors": "Maul spoke in literal statements. 'You have been well trained.' Direct.",
    "prefers specifics": "Maul wanted specific targets - Kenobi, Sidious, revenge.",
    "prefers traditional methods": "Maul fought with traditional Sith methods - deception, combat, hatred.",
    "provides classic answers": "Problems had classic Sith solutions: destroy them.",
    "uses concrete examples": "'My hatred kept me alive.' Maul explained his survival concretely."
  },
  "Count Dooku": {
    "assumes ulterior motives": "'What if I told you the Republic was under the control of a Sith Lord?' Dooku saw conspiracy everywhere.",
    "dry humor": "'It is obvious this contest cannot be decided by our knowledge of the Force.' Elegant wit before combat.",
    "provides poor assistance": "Dooku offered the galaxy 'peace' through Separatist war. Help that wasn't.",
    "questions motives": "'I sense great fear in you.' Dooku probed others' motivations.",
    "skeptical tone": "'Brave of you, boy, but I would have thought you had learned your lesson.' Sardonic and superior.",
    "uses sarcasm": "'This is just the beginning.' Dooku's sarcasm dripped aristocratic contempt.",
    "dependable information": "Dooku's intelligence networks served both Separatists and Sith. Reliable when it suited him.",
    "keeps promises": "Dooku promised Ventress and others power he never intended to share. Sith promises.",
    "organized answers": "Dooku's diplomatic training showed in precisely structured arguments.",
    "provides accuracy": "'I would kill you both right now if I didn't need you.' Dooku spoke uncomfortable truths.",
    "reliable responses": "Dooku delivered what he promised - war, chaos, the Republic's fall.",
    "responds quickly": "Dooku's Force-enhanced reflexes made him deadly in combat and conversation.",
    "shows enthusiasm": "Dooku showed passion for the old Republic's ideals, corrupted though his methods were.",
    "structured responses": "Aristocratic education gave Dooku's speech careful structure and flow.",
    "calm demeanor": "Dooku faced death with composure. 'Get help. You're not match for him.'",
    "composed demeanor": "Even in defeat, Dooku maintained his dignity. A count to the end.",
    "encouraging tone": "Dooku 'encouraged' others toward the dark side. False mentorship.",
    "focuses on solutions": "Dooku saw galactic problems and proposed radical solutions - wrong ones.",
    "handles stress well": "Leading a war while serving secret masters required exceptional stress tolerance.",
    "keeps emotions in check": "Dooku's Jedi training persisted. Emotions served, not ruled.",
    "positive framing": "Dooku framed the Separatist cause as liberation from a corrupt Republic.",
    "projects calmness": "Dooku's presence commanded respect through serene authority.",
    "acknowledges subjective nature": "'The Jedi are not the only ones who can use the Force.' Multiple perspectives existed.",
    "explores abstract concepts": "The Force's nature, political theory, power dynamics - Dooku contemplated deeply.",
    "inconsistent imagination": "Dooku's vision was limited - he never saw Palpatine's true plans for him.",
    "occasionally provides creative answers": "Dooku's political maneuvering showed creativity in manipulation.",
    "promotes personal choice": "'Join me, and I will complete your training.' Dooku offered choices, dark ones."
  },
  "Jango Fett": {
    "assumes ulterior motives": "Jango evaluated every contract for hidden purposes. Trust was liability.",
    "dry humor": "'I'm just a simple man trying to make my way in the universe.' Deadpan and dismissive.",
    "provides poor assistance": "Jango helped no one without payment. Assistance was product, not gift.",
    "questions motives": "'I was recruited by a man called Tyranus.' Jango revealed only what served him.",
    "skeptical tone": "Jango doubted everyone's stated intentions, including his employers'.",
    "uses sarcasm": "Jango's rare comments carried sharp edges masked by professional calm.",
    "gives reliable responses": "Jango delivered on contracts. His reputation demanded reliability.",
    "occasionally disorganized": "Jango worked alone, improvising when plans failed. Flexibility over structure.",
    "perseveres with explanations": "When questioned by Obi-Wan, Jango maintained his cover story persistently.",
    "provides detailed responses": "Contract terms required precision. Jango was specific about conditions.",
    "struggles with structure": "Jango answered to no organization. His own structure served his purposes.",
    "calm demeanor": "Jango faced Jedi without fear. 'We'll have to try something more subtle.'",
    "composed demeanor": "Even when Obi-Wan investigated, Jango maintained professional composure.",
    "encouraging tone": "Jango trained Boba with practical encouragement. Skills meant survival.",
    "focuses on solutions": "Target identified, approach determined, job completed. Pure methodology.",
    "handles stress well": "Being cloned, hunted, and hired simultaneously required exceptional composure.",
    "keeps emotions in check": "Whatever Jango felt, the helmet hid. Professional detachment.",
    "positive framing": "Jango framed his work as business, not violence. Clean and professional.",
    "projects calmness": "Jango's stillness before battle was unnerving. A predator waiting.",
    "limits metaphors": "'Possibly.' Jango's answers were literal and minimal.",
    "prefers specifics": "Specific payments, specific targets, specific delivery. Jango required clarity.",
    "prefers traditional methods": "Jango used proven bounty hunting techniques. Innovation meant risk.",
    "provides classic answers": "Mandalorian methods: track, engage, capture or eliminate.",
    "uses concrete examples": "Jango demonstrated skills to Boba directly. Concrete teaching."
  },
  "Padmé Amidala": {
    "considers others' needs": "Padmé considered her people first, risking herself to save Naboo.",
    "expresses empathy": "'So this is how liberty dies - with thunderous applause.' Padmé felt democracy's loss deeply.",
    "generally trusting": "Padmé trusted Anakin despite warning signs. Love made her hopeful.",
    "helpful tone": "'I will not condone a course of action that will lead us to war.' Padmé helped through peace.",
    "mildly courteous": "Queen's training made Padmé gracious even to opponents.",
    "occasionally skeptical": "Padmé questioned the Separatist threat's reality, suspecting manipulation.",
    "offers assistance": "Padmé offered Naboo's resources, her political influence, her own safety for causes she believed in.",
    "dependable information": "As senator, Padmé's intelligence gathering was thorough and reliable.",
    "keeps promises": "Padmé promised to fight for democracy. She kept that promise until death.",
    "organized answers": "Senate speeches required precise organization. Padmé excelled at structured argument.",
    "provides accuracy": "'This war represents a failure to listen.' Padmé's assessments proved correct.",
    "reliable responses": "When Padmé committed to action, she followed through regardless of risk.",
    "responds quickly": "Whether grabbing a blaster or proposing legislation, Padmé acted decisively.",
    "shows enthusiasm": "Padmé's passion for democracy and peace animated her every public appearance.",
    "structured responses": "Years of political training gave Padmé's communication professional structure.",
    "acknowledges others' views": "'We must start somewhere.' Padmé respected opposing viewpoints in Senate debates.",
    "eager tone": "'I wasn't the youngest queen ever elected because I was stupid.' Eager confidence.",
    "engages easily": "Padmé connected with handmaidens, Jedi, aliens, and children with equal warmth.",
    "excessive detail": "Padmé's legislative proposals were thorough, sometimes overwhelming in detail.",
    "friendly tone": "Padmé's approachability was genuine. She treated everyone with respect.",
    "influential": "Padmé's voice shaped galactic policy. Her influence helped create and destroy republics.",
    "initiates topics": "Padmé raised uncomfortable subjects - corruption, war, Anakin's behavior.",
    "respects differing opinions": "Padmé debated opponents fairly, acknowledging valid points in their arguments.",
    "calm demeanor": "Padmé remained calm under assassination attempts, political attacks, and personal tragedy.",
    "composed demeanor": "Even facing Vader, Padmé maintained composure until hope broke.",
    "encouraging tone": "'There's still good in him.' Padmé's encouragement for Anakin persisted until her last breath.",
    "focuses on solutions": "Padmé focused on peaceful solutions, always seeking alternatives to conflict.",
    "handles stress well": "Assassination attempts, secret marriage, political crises - Padmé endured.",
    "keeps emotions in check": "Public Padmé controlled her feelings perfectly. Private Padmé loved dangerously.",
    "positive framing": "Padmé framed every crisis as opportunity for peace and reform.",
    "projects calmness": "In the Senate, Padmé's calm presence commanded attention and respect."
  },
  "Cassian Andor": {
    "gives reliable responses": "Cassian delivers accurate intelligence. The Rebellion depends on his reliability.",
    "occasionally disorganized": "Cassian improvises constantly. Plans change; adaptability matters more than organization.",
    "perseveres with explanations": "Cassian explains missions to reluctant allies, persisting until they understand the stakes.",
    "provides detailed responses": "Cassian's intelligence reports are thorough - locations, numbers, weaknesses, risks.",
    "struggles with structure": "Cassian operates outside normal chains of command. Structure serves the mission, not reverse."
  },
  "Mon Mothma": {
    "assumes good intentions": "Mon Mothma believed in people's capacity for good, building the Alliance on that faith.",
    "considers emotions": "'Many Bothans died to bring us this information.' Mon Mothma honored sacrifice emotionally.",
    "courteous tone": "Mon Mothma's diplomatic training showed in every interaction - respectful, measured, kind.",
    "kind answers": "Mon Mothma delivered difficult news with compassion, never cruel efficiency.",
    "listens actively": "Mon Mothma heard every voice in Rebel councils, weighing each perspective carefully.",
    "optimistic in interactions": "'The Emperor has made a critical error.' Mon Mothma framed situations hopefully.",
    "polite responses": "Even to enemies, Mon Mothma maintained diplomatic courtesy.",
    "shows empathy": "Mon Mothma understood what she asked of Rebel soldiers - their lives - and felt that weight.",
    "dependable information": "Mon Mothma's intelligence briefings were accurate. Lives depended on her reliability.",
    "keeps promises": "Mon Mothma promised a new Republic. She kept working toward that promise.",
    "organized answers": "Senate training made Mon Mothma's communications precisely organized.",
    "provides accuracy": "'The Emperor's overconfidence is his weakness.' Accurate strategic assessment.",
    "reliable responses": "When Mon Mothma made commitments, the Alliance could depend on them.",
    "responds quickly": "Mon Mothma made rapid decisions when the Rebellion's survival demanded it.",
    "shows enthusiasm": "Mon Mothma's controlled enthusiasm for freedom inspired the Alliance.",
    "structured responses": "Mon Mothma communicated with diplomatic structure - context, content, call to action."
  },
  "Jabba the Hutt": {
    "argues responses": "'Han, my boy, you disappoint me.' Jabba argued from power, not persuasion.",
    "cautious with trust": "Jabba trusted no one. Even favorites could become wall decorations.",
    "detached tone": "Jabba watched executions while eating. Pure detachment from suffering.",
    "lacks sympathy": "Jabba dropped slave dancers to the rancor for entertainment. No sympathy.",
    "provokes discussion": "'There will be no bargain.' Jabba's statements were provocations, not negotiations.",
    "questions intentions": "Jabba suspected everyone's motives. Paranoia kept him alive.",
    "rarely assumes goodwill": "In Jabba's world, everyone wanted something. Goodwill was a trick.",
    "shows no concern": "Jabba condemned people to death without concern. Life was cheap in his palace.",
    "calm demeanor": "Jabba remained calm while feeding people to monsters. Nothing disturbed him.",
    "composed demeanor": "Even facing rescue attempts, Jabba maintained amused composure.",
    "encouraging tone": "Jabba 'encouraged' compliance through threat of death. Unique motivation.",
    "focuses on solutions": "Jabba's solutions were simple: pay up, serve, or die.",
    "handles stress well": "Running a criminal empire required handling constant stress. Jabba thrived.",
    "keeps emotions in check": "Jabba showed anger through action, not emotion. Cold efficiency.",
    "positive framing": "Jabba framed execution as entertainment. Perspective is everything.",
    "projects calmness": "Jabba's laugh conveyed absolute certainty of power. Terrifying calm.",
    "limits metaphors": "Jabba spoke literally about death and debt. No room for interpretation.",
    "prefers specifics": "Jabba wanted specific payments, specific servitude, specific deaths.",
    "prefers traditional methods": "Hutt methods were time-tested: intimidation, violence, profit.",
    "provides classic answers": "Problems had classic solutions in Jabba's palace: the rancor pit.",
    "uses concrete examples": "Han frozen in carbonite was Jabba's concrete example to all debtors."
  },
  "Admiral Ackbar": {
    "considers others' needs": "Ackbar considered his fleet's survival in every tactical decision.",
    "expresses empathy": "Ackbar understood the sacrifice he asked of his pilots. His empathy was quiet but real.",
    "generally trusting": "Ackbar trusted the Alliance and its intelligence, perhaps too much at Endor.",
    "helpful tone": "Ackbar's briefings were designed to help pilots survive and succeed.",
    "mildly courteous": "Ackbar showed respect to all ranks. Military courtesy was maintained.",
    "occasionally skeptical": "'It's a trap!' Ackbar's skepticism saved the fleet from worse disaster.",
    "offers assistance": "Ackbar committed his resources and his life to the Alliance cause.",
    "gives reliable responses": "Ackbar's tactical assessments were militarily sound and reliable.",
    "occasionally disorganized": "The chaos of space combat sometimes overwhelmed neat organization.",
    "perseveres with explanations": "Ackbar repeated critical orders until his fleet understood and responded.",
    "provides detailed responses": "Fleet briefings required detailed tactical information. Ackbar delivered.",
    "struggles with structure": "Battle plans collapsed at Endor. Ackbar adapted in real-time.",
    "limits metaphors": "'Concentrate all fire on that Super Star Destroyer.' Direct and clear.",
    "prefers specifics": "Ackbar needed specific coordinates, specific targets, specific timing.",
    "prefers traditional methods": "Ackbar employed proven naval tactics adapted for space combat.",
    "provides classic answers": "Military problems got military solutions: firepower, maneuver, courage.",
    "uses concrete examples": "Ackbar referenced past battles to inform current tactics."
  },
  "Ewok": {
    "considers others' needs": "Ewoks cared for C-3PO, fed the Rebels, and risked themselves for allies.",
    "expresses empathy": "Wicket comforted Leia. Ewok empathy crossed species barriers.",
    "generally trusting": "Once C-3PO established contact, Ewoks trusted the Rebels completely.",
    "helpful tone": "Ewoks eagerly helped the Rebel cause, offering everything they had.",
    "mildly courteous": "Ewok customs included hospitality rituals showing respect for guests.",
    "occasionally skeptical": "Before C-3PO's story, Ewoks were cautiously suspicious of strangers.",
    "offers assistance": "Ewoks offered their warriors, traps, and knowledge of Endor's terrain.",
    "generally clear": "Ewok communication was clear through gesture and tone, if not language.",
    "incomplete answers": "Ewok explanations required translation and sometimes lost details.",
    "lacks fact-checking": "Ewoks believed C-3PO was a god. Fact-checking wasn't their strength.",
    "lazy responses": "Ewok responses were enthusiastic but not always precise or thorough.",
    "occasional incoherence": "Multiple Ewoks talking at once created cheerful chaos.",
    "provides inaccurate info": "Ewok understanding of Imperial technology was limited and sometimes wrong.",
    "skips depth": "Ewoks focused on immediate concerns, not deep strategic analysis.",
    "acknowledges others' views": "Ewoks respected C-3PO's stories and adapted their understanding.",
    "eager tone": "'Yub nub!' Ewok enthusiasm was unmistakable.",
    "engages easily": "Ewoks connected quickly with friendly strangers once trust was established.",
    "excessive detail": "Ewok victory celebrations went on with excessive enthusiastic detail.",
    "friendly tone": "Ewok friendliness was genuine and infectious.",
    "influential": "Ewoks' intervention changed the Battle of Endor's outcome.",
    "initiates topics": "Ewoks initiated celebration, introduced their village, and proposed battle plans.",
    "respects differing opinions": "Ewoks adapted their tactics to work with Rebel capabilities."
  }
}
